```terraform
terraform {
  required_providers {
    artifactory = {
      source  = "registry.terraform.io/jfrog/artifactory"
      version = "2.2.5"
    }
  }
}
provider "artifactory" {
  url = "https://partnership.jfrog.io/artifactory"
  api_key = "xxxxxx"
}
resource "artifactory_local_repository" "docker-dev-local" {
  key = "docker-dev-local"
  package_type = "docker"
}
```
results:
```bash
christianb@christianb-mac terraform-provider-artifactory % terraform init 

Initializing the backend...

Initializing provider plugins...
- Using previously-installed jfrog/artifactory v2.2.5

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
christianb@christianb-mac terraform-provider-artifactory % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_local_repository.docker-dev-local will be created
  + resource "artifactory_local_repository" "docker-dev-local" {
      + blacked_out                     = (known after apply)
      + checksum_policy_type            = (known after apply)
      + docker_api_version              = (known after apply)
      + enable_file_lists_indexing      = (known after apply)
      + excludes_pattern                = (known after apply)
      + force_nuget_authentication      = (known after apply)
      + handle_releases                 = (known after apply)
      + handle_snapshots                = (known after apply)
      + id                              = (known after apply)
      + includes_pattern                = (known after apply)
      + key                             = "docker-dev-local"
      + max_unique_snapshots            = (known after apply)
      + max_unique_tags                 = (known after apply)
      + package_type                    = "docker"
      + repo_layout_ref                 = (known after apply)
      + snapshot_version_behavior       = (known after apply)
      + suppress_pom_consistency_checks = (known after apply)
      + xray_index                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

artifactory_local_repository.docker-dev-local: Creating...
artifactory_local_repository.docker-dev-local: Creation complete after 1s [id=docker-dev-local]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
christianb@christianb-mac terraform-provider-artifactory % 

```

I would say the issue is with the state in your s3 bucket.